In [36]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv('../data/titanic.csv', na_values=[np.nan, 'NA', 'Missing'])
df.head(6)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,"Anderson, Mr Harry",1st,47.00,male,1,0

In [38]:
#Getting some info about the data
df.shape

(1313, 6)

In [39]:
df.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      1313 non-null   object
 1   PClass    1313 non-null   object
 2   Age       756 non-null    float64
 3   Sex       1313 non-null   object
 4   Survived  1313 non-null   int64
 5   SexCode   1313 non-null   int64
dtypes: float64(1), int64(2), object(3)
memory usage: 61.7+ KB

In [41]:
#Slicing the data
#Get the sixth row
df.iloc[5]

Name        Anderson, Mr Harry
PClass                     1st
Age                       47.0
Sex                       male
Survived                     1
SexCode                      0
Name: 5, dtype: object

In [42]:
#Selecting rows based on conditions
#Get all the rows with females
df[df['Sex']=='female'].head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1

In [43]:
df[(df['Age']>50) & (df['Sex']=='female')].head()

,Name,PClass,Age,Sex,Survived,SexCode
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1
28,"Bonnell, Miss Elizabeth",1st,58.0,female,1,1
37,"Brown, Mrs John Murray (Caroline Lane Lamson)",1st,59.0,female,1,1
38,"Bucknell, Mrs William Robert (Emma Eliza Ward)",1st,60.0,female,1,1

In [44]:
#Sorting values
df.sort_values(by=['Age']).head()

,Name,PClass,Age,Sex,Survived,SexCode
763,"Dean, Miss Elizabeth Gladys (Millvena)",3rd,0.17,female,1,1
751,"Danbom, Master Gilbert Sigvard Emanuel",3rd,0.33,male,0,0
544,"Richards, Master George Sidney",2nd,0.80,male,1,0
616,"Aks, Master Philip",3rd,0.83,male,1,0
358,"Caldwell, Master Alden Gates",2nd,0.83,male,1,0

In [45]:
#Replacing values
df.replace(r"1st", "First", regex=True).head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",First,29.00,female,1,1
1,"Allison, Miss Helen Loraine",First,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",First,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",First,25.00,female,0,1
4,"Allison, Master Hudson Trevor",First,0.92,male,1,0

In [46]:
#Renaming columns
df.rename(columns={"PClass": "Passenger Class"}).head()

,Name,Passenger Class,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [47]:
#show counts 
df.count()

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

In [48]:
#Finding unique values
df['PClass'].value_counts()

PClass
3rd    711
1st    322
2nd    279
*        1
Name: count, dtype: int64

In [49]:
df['Sex'].unique()

array(['female', 'male'], dtype=object)

In [50]:
df['PClass'].nunique()

4

In [56]:
#Handling missing values
df.isnull().sum()

Name          0
PClass        0
Age         557
Sex           0
Survived      0
SexCode       0
dtype: int64

In [55]:
#Full all the null values in the Age column with the mean of the Age column
df.fillna(df['Age'].mean()).isnull().sum()

Name        0
PClass      0
Age         0
Sex         0
Survived    0
SexCode     0
dtype: int64

In [57]:
#Check whether there are any duplicate rows
df.duplicated().sum()

np.int64(0)

In [59]:
#Grouping rows based on column values
df.groupby('PClass').mean(numeric_only=True
                          )

              Age  Survived   SexCode
PClass
*             NaN  0.000000  0.000000
1st     39.667788  0.599379  0.444099
2nd     28.300142  0.426523  0.383513
3rd     25.208585  0.194093  0.298172

In [ ]:
#Grouping by time
time_index= pd.date_range('06/06/2017', periods=100, freq='D')
df1 = pd.DataFrame(index=time_index)
df1['Sale_Amount'] = np.random.randint(0,100,100)
df1.resample('M').count()

            Sale_Amount
2017-06-11            6
2017-06-18            7
2017-06-25            7
2017-07-02            7
2017-07-09            7
2017-07-16            7
2017-07-23            7
2017-07-30            7
2017-08-06            7
2017-08-13            7
2017-08-20            7
2017-08-27            7
2017-09-03            7
2017-09-10            7
2017-09-17            3

In [70]:
#Applying a function to a group
df.groupby('Sex').count()

        Name  PClass  Age  Survived  SexCode
Sex
female   462     462  288       462      462
male     851     851  468       851      851

In [75]:
#Concatenating dataframes
data_a = {'id':['1','2', '3'],
          'first':['Alex', 'Amy', 'Allen'],
          'last':['Anderson', 'Ackerman', 'Ali']}
df_a = pd.DataFrame(data_a, columns=['id','first','last'])
data_b = {'id':['4','5','6'],
          'first':['Billy', 'Brian', 'Bran'],
          'last':['Bonder','Black','Balwner']}
df_b = pd.DataFrame(data_b, columns=['id', 'first', 'last'])
pd.concat([df_a, df_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [76]:
#Merging dataframes
employee_data = {'employee_id':['1','2','3','4'],
                 'name':['Amy Jones', 'Allen Keys', 'Alice Bees', 'Tim Horton']}
employee_df = pd.DataFrame(employee_data, columns=['employee_id', 'name'])
employee_df

  employee_id        name
0           1   Amy Jones
1           2  Allen Keys
2           3  Alice Bees
3           4  Tim Horton

In [77]:
sales_data = {'employee_id':['3','4','5','6'],
              'total_sales':[23456,2512,2345,1455]}
sales_df = pd.DataFrame(sales_data, columns=['employee_id', 'total_sales'])
sales_df

  employee_id  total_sales
0           3        23456
1           4         2512
2           5         2345
3           6         1455

In [78]:
#Merging only the common data in both
pd.merge(employee_df, sales_df)

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [79]:
#Merging the two whether regardless
pd.merge(employee_df, sales_df, how='outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0

In [ ]:
#Returning all rows from the employees dataframe
pd.merge(employee_df,sales_df, how='left')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0

In [ ]:
#Returning all rows for sales dataframe
pd.merge(employee_df, sales_df, how='right')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512
2           5         NaN         2345
3           6         NaN         1455